pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/DMA_208.0_inst6.xml
    <register id="DMA4SA" width="20" offset="0x52" internal="0" description="DMA Channel 4 Source Address">
    </register>
    <register id="DMA4DA" width="20" offset="0x56" internal="0" description="DMA Channel 4 Destination Address">
    </register>
    <register id="DMA4SZ" width="16" offset="0x5A" internal="0" description="DMA Channel 4 Transfer Size">
    </register>
    <register id="DMA5CTL" width="16" offset="0x60" internal="0" description="DMA Channel 5 Control">
        <bitfield id="DMAREQ" description="DMA request" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DMAREQ_0" value="0x0" description="No DMA start"/>
            <bitenum id="DMAREQ_1" value="0x1" description="Start DMA"/>
        </bitfield>
        <bitfield id="DMAABORT" description="DMA abort" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DMAABORT_0" value="0x0" description="DMA transfer not interrupted"/>
            <bitenum id="DMAABORT_1" value="0x1" description="DMA transfer interrupted by NMI"/>
        </bitfield>
        <bitfield id="DMAIE" description="DMA interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled"/>
        </bitfield>
        <bitfield id="DMAIFG" description="DMA interrupt flag" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DMAIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="DMAIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="DMAEN" description="DMA enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Enabled"/>
        </bitfield>
        <bitfield id="DMALEVEL" description="DMA level" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="EDGE" value="0x0" description="Edge sensitive (rising edge)"/>
            <bitenum id="LEVEL" value="0x1" description="Level sensitive (high level)"/>
        </bitfield>
        <bitfield id="DMASRCBYTE" description="DMA source byte" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="WORD" value="0x0" description="Word"/>
            <bitenum id="BYTE" value="0x1" description="Byte"/>
        </bitfield>
        <bitfield id="DMADSTBYTE" description="DMA destination byte" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="WORD" value="0x0" description="Word"/>
            <bitenum id="BYTE" value="0x1" description="Byte"/>
        </bitfield>
        <bitfield id="DMASRCINCR" description="DMA source increment" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DMASRCINCR_0" value="0x0" description="Source address is unchanged"/>
            <bitenum id="DMASRCINCR_1" value="0x1" description="Source address is unchanged"/>
            <bitenum id="DMASRCINCR_2" value="0x2" description="Source address is decremented"/>
            <bitenum id="DMASRCINCR_3" value="0x3" description="Source address is incremented"/>
        </bitfield>
        <bitfield id="DMADSTINCR" description="DMA destination increment" begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DMADSTINCR_0" value="0x0" description="Destination address is unchanged"/>
            <bitenum id="DMADSTINCR_1" value="0x1" description="Destination address is unchanged"/>
            <bitenum id="DMADSTINCR_2" value="0x2" description="Destination address is decremented"/>
            <bitenum id="DMADSTINCR_3" value="0x3" description="Destination address is incremented"/>
        </bitfield>
        <bitfield id="DMADT" description="DMA transfer mode" begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="DMADT_0" value="0x0" description="Single transfer"/>
            <bitenum id="DMADT_1" value="0x1" description="Block transfer"/>
            <bitenum id="DMADT_2" value="0x2" description="Burst-block transfer"/>
            <bitenum id="DMADT_3" value="0x3" description="Burst-block transfer"/>
            <bitenum id="DMADT_4" value="0x4" description="Repeated single transfer"/>
            <bitenum id="DMADT_5" value="0x5" description="Repeated block transfer"/>
            <bitenum id="DMADT_6" value="0x6" description="Repeated burst-block transfer"/>
            <bitenum id="DMADT_7" value="0x7" description="Repeated burst-block transfer"/>
        </bitfield>
    </register>
    <register id="DMA5SA" width="20" offset="0x62" internal="0" description="DMA Channel 5 Source Address">
    </register>
    <register id="DMA5DA" width="20" offset="0x66" internal="0" description="DMA Channel 5 Destination Address">
    </register>
    <register id="DMA5SZ" width="16" offset="0x6A" internal="0" description="DMA Channel 5 Transfer Size">
    </register>
</module>
